{
  "Seductive Aura": {
    "description": "Your mere presence makes hearts race and minds fog.",
    "effect": "Once per encounter, you can charm one humanoid creature within 30 feet. The target must succeed on a Wit saving throw (DC = 10 + your Charisma modifier) or be charmed by you for 1d4 turns.",
    "range": "30 feet",
    "abilityPointCost": 3,
    "cooldown": "Once per encounter"
  },
  "Feline Agility": {
    "description": "You move with the grace and speed of a tiger.",
    "effect": "Once per encounter, you can double your movement speed for one turn.",
    "abilityPointCost": 2,
    "cooldown": "Once per encounter"
  },
  "Adaptability": {
    "description": "Humans are known for their ability to adapt to any situation.",
    "effect": "Once per encounter, you can reroll any skill check, attack roll, or saving throw. You must use the new roll.",
    "abilityPointCost": 1,
    "cooldown": "Once per encounter"
  },
  "Sky's the Limit": {
    "type": "Activated",
    "description": "The aerialist performs a series of flips and twists, confusing enemies and gaining an advantage.",
    "effect": "Gain +4 to AC and advantage on Dexterity saving throws for 1 minute.",
    "range": "Self",
    "abilityPointCost": 3,
    "cooldown": "1 hour",
    "scaling": "Increases AC bonus by +1 for every 3 additional levels."
  },
  "Death-Defying Leap": {
    "type": "Activated",
    "description": "The aerialist makes a daring leap to escape or engage enemies.",
    "effect": "Move up to 60 feet in a straight line, ignoring difficult terrain and avoiding opportunity attacks.",
    "range": "Self",
    "abilityPointCost": 2,
    "cooldown": "1 turn",
    "scaling": "Distance increases by 10 feet for every 2 additional levels."
  },
  "Indomitable Will": {
    "type": "Activated",
    "description": "The fighter's sheer willpower enables them to shrug off effects that would hinder others.",
    "effect": "Gain advantage on all saving throws for 1 minute.",
    "range": "Self",
    "abilityPointCost": 3,
    "cooldown": "1 hour",
    "scaling": "Duration increases by 1 round for every 2 additional levels."
  },
  "Chaos Unleashed": {
    "type": "Activated",
    "description": "The anarchist creates a chaotic distraction, causing confusion among enemies.",
    "effect": "All enemies within 30 feet must make a Wit saving throw or be confused for 1 minute.",
    "range": "30 feet",
    "abilityPointCost": 4,
    "cooldown": "1 hour",
    "scaling": "Increase range by 5 feet for every 3 additional levels."
  },
  "Guardian's Stand": {
    "type": "Activated",
    "description": "The Shield Maiden plants her shield, creating a protective barrier around her allies.",
    "effect": "Allies within 20 feet gain +4 to AC and resistance to all damage types for 1 minute.",
    "range": "20 feet",
    "abilityPointCost": 5,
    "cooldown": "1 hour",
    "scaling": "Increases AC bonus by +1 for every 3 additional levels."
  },
  "Shield Bash": {
    "type": "Activated",
    "description": "The Shield Maiden strikes with her shield, stunning enemies.",
    "effect": "Deals 1d8 bludgeoning damage and the target must make a Constitution saving throw or be stunned for 1 round.",
    "range": "Melee",
    "damage": "1d8",
    "damageType": "Bludgeoning",
    "abilityPointCost": 2,
    "cooldown": "1 turn",
    "scaling": "Damage increases by 1d8 for every 2 additional levels."
  },
  "Curve Shot": {
    "description": "Allows the user to throw the weapon in a curve, hitting targets around corners or behind cover.",
    "effect": "This ability can be used once per combat encounter.",
    "abilityPointCost": 3,
    "cooldown": "Once per combat encounter"
  },
  "Birth Defect": {
    "description": "Casts Birth Defect on monster types who generate or birth additional monsters, causing them to suffer debilitating mutations and reduced spawning rates.",
    "effect": "Debilitating mutations and reduced spawning rates.",
    "abilityPointCost": 8,
    "cooldown": "Varies"
  },
  "Meteor Strike": {
    "description": "Once per day, slam the maul into the ground to create a shockwave that deals 3d10 damage to all enemies within 20 feet.",
    "effect": "Deals 3d10 damage to all enemies within 20 feet.",
    "abilityPointCost": 5,
    "cooldown": "Once per day"
  },
  "Chain Whirl": {
    "description": "Allows the user to attack all enemies within 10 feet in a single round, dealing 1d6 damage to each.",
    "effect": "Deals 2d12 damage to each enemy within 10 feet.",
    "abilityPointCost": 3,
    "cooldown": "Varies"
  },
  "Flame Burst": {
    "description": "Can cast a fireball that deals 3d6 fire damage with a 10-minute cooldown.",
    "effect": "Deals 3d6 fire damage.",
    "abilityPointCost": 3,
    "cooldown": "10 minutes"
  },
  "Echo Serenade": {
    "description": "After a successful hit, can play a tune that causes nearby enemies to be distracted for one round.",
    "effect": "Nearby enemies are distracted for one round.",
    "abilityPointCost": 4,
    "cooldown": "Varies"
  },
  "Crystal Vibration": {
    "description": "Can cast a healing aura that restores 1d6 HP to all allies within 10 feet once per hour.",
    "effect": "Restores 1d6 HP to all allies within 10 feet.",
    "abilityPointCost": 1,
    "cooldown": "Once per hour"
  },
  "Incinerate": {
    "description": "Sprays a stream of fire that deals 1d6 fire damage per round for 2 rounds.",
    "effect": "Deals 1d6 fire damage per round for 2 rounds.",
    "abilityPointCost": 2,
    "cooldown": "Varies"
  },
  "Avalanche": {
    "description": "This ability is straightforward. If you hit a living creature with your body while you are moving, the force exerted upon that body will be as if they were hit by twice the mass. Your entire body must be moving for this benefit to activate. This benefit’s power will not translate to weapons. You might want to take this off if you plan on getting busy with someone. Especially if you’re the top",
    "effect": "When you move at least 10 feet in a straight line towards a living creature and hit it with an unarmed strike or a slam attack (considered an unarmed strike for this purpose), the target takes additional damage equal to twice your Stamina score. Your entire body must be moving for this benefit to activate. This additional damage does not apply to weapon attacks. If you hit a creature with this attack, you can choose to push the creature up to 30 feet away from you if it is no more than two sizes larger than you. Once you use this feature, you cannot use it again until you finish a short or long rest.",
    "abilityPointCost": 8,
    "cooldown": "Once per day"
  },
  "Remote Detonator": {
    "description": "If you’re one of those explodey guys, I bet you use a lot of Hobgoblin Pus or Troll Boom-Boom Paste to make your bombs pop. Those days are now over. This benefit allows you to magically remote-detonate any explosive that has been designated by you. This benefit offers multiple physical and interface-based triggering options when combined with a Sapper’s table.",
    "effect": "When using a Sapper’s Table, you gain access to the following physical and interface-based triggering options for any explosive you have designated: \n \n <b>Physical Triggering Options:</b> \n \n <b>Timed Detonation:</b> Set a timer on the explosive to detonate after a specified duration. \n \n <b>Pressure Plate:</b> Detonate the explosive when a certain amount of weight or pressure is applied. \n \n <b>Tripwire:</b> Rig a tripwire to detonate the explosive when disturbed. \n \n <b>Proximity Sensor:</b> Set the explosive to detonate when a creature or object enters a specified radius. \n \n <b>Interface-Based Triggering Options:</b> \n \n <b>Magical Remote Control:</b> Use a magical remote control to trigger the explosive from a distance. \n \n <b>Telepathic Link:</b> Establish a telepathic link to trigger the explosive mentally. \n \n <b>Arcane Signal:</b> Activate the explosive using a specific magical gesture or incantation. \n \n <b>Rune Activation:</b> Use a magical interface to activate a special rune on the explosive. \n \n <b>Special Note:</b> The range for remote triggering options is up to 120 feet, unless otherwise specified by the DM."
  },
  "Ripe": {
    "description": "Enhances the wearer's ability to land the finishing blow on any target, granting a bonus to damage dealt to enemies below 20% health. The bonus increases with the wearer's Dexterity stat, adding a sense of urgency to every encounter.",
    "effect": "60 feet",
    "abilityPointCost": 2,
    "cooldown": "1 turn"
  },
  "Loaded": {
    "description": "Grants the wearer increased critical hit chance with ranged attacks, enhancing their sniping prowess. The chance of landing a critical hit increases based on the wearer's Perception stat, turning them into a deadly marksman. The total needed for a critical hit decreases by 1 for every level of perception over 10.",
    "effect": "600 feet",
    "abilityPointCost": 5,
    "cooldown": "4 turns"
    }
  }